<?xml version="1.0" encoding="iso-8859-1"?>
<!-- $Revision: 1.5 $ -->

<appendix id="history">
 <title>A História do PHP e projetos relacionados</title>
 <para>
  O PHP percorreu um longo caminho ao nesses poucos 
  anos. Criada para ser uma das mais poderosas e 
  proeminentes linguagens da Web n&atilde;o foi uma 
  tarefa f&aacute;cil. Aqueles que se interessaram 
  momentaneamente em ver como o PHP cresceu e se 
  tornou o que &eacute; hoje, continue lendo.
 </para>
 
 <sect1 id="history.php">
  <title>A História do PHP</title>
  
  <sect2 id="history.phpfi">
   <title>PHP/FI</title>
   <para>
    O PHP sucede de um produto mais antigo, chamado PHP/FI. 
	PHP/FI foi criado por Rasmus Lerdorf em 1995, inicialmente 
	como simples scripts Perl como estat&iacute;sticas de acesso 
	para seu curr&iacute;culo online. Ele nomeou esta s&eacute;rio 
	de script para 'Personal Home Page Tools'. Como mais 
	funcionalidades foram requeridas, Rasmus escreveu uma 
	implementa&ccedil;&atilde;o C muito maior, que era capaz de 
	comunicar-se com base de dados, e possibilitava &agrave; 
	usu&aacute;rios desenvolver simples aplicativos din&acirc;micos 
	para Web. Rasmus decidiu disponibilizar o c&oacute;digo 
	fonte do PHP/FI para que todos pudessem ver, e tamb&eacute;m 
	us&aacute;-lo, bem como fixar bugs e melhorar o c&oacute;digo.
   </para>
   <para>
    PHP/FI, que significa Personal Home Page / Forms Interpreter, 
	inclu&iacute;a algumas funcionalidades b&aacute;sicas do PHP 
	que n&oacute;s conhecemos hoje. Ele usava vari&aacute;veis no 
	estilo Perl, interpreta&ccedil;&atilde;o autom&aacute;tica 
	de vari&aacute;veis vindas  de formul&aacute;rio e sintaxe 
	embutida no HTML. A sua pr&oacute;pria sintaxe era similar a 
	do Perl, por&eacute;m muito mais limitada, simples, e um 
	pouco inconsistente.
   </para>
   <para>
    Em 1997, PHP/FI 2.0, a segunda versão da implementação C, 
	obteve milhares de usuários ao redor do mundo (estimado), 
	com aproximadamente 50,000 domínios reportando que tinha 
	PHP/FI 2.0 instalado, agarinhando 1% dos domínios da Internet. 
	Enquanto isto havia milhares de pessoas contribuindo com pequenos 
	códigos para o projeto, e ainda assim
    By 1997, PHP/FI 2.0, the second write-up of the C implementation,
    had a cult of several thousand users around the world
    (estimated), with approximately 50,000 domains reporting as
    having it installed, accounting for about 1% of the domains
    on the Internet. While there were several people contributing
    bits of code to this project, it was still at large a one-man
    project.
   </para>
   <para>
    O PHP/FI 2.0 foi oficialmente lan&ccedil;ado somente em 
	Novembro de 1997, ap&oacute;s perder a maior parte de 
	sua vida em vers&otilde;es betas. Ele foi rapidamente 
	substitu&iacute;do pelos alphas do PHP 3.0.
   </para>
  </sect2>

  <sect2 id="history.php3">
   <title>PHP 3</title>
   <para>
    O PHP 3.0 foi a primeira vers&atilde;o que se assemelha ao 
	PHP que n&oacute;s conhecemos hoje. Ela foi criada por Andi 
	Gutmans e Zeev Suraski em 1997 e foi totalmente reescrito, 
	ap&oacute;s eles 	descobrirem que o PHP/FI 2.0 poderia 
	ajud&aacute;-los a desenvolver suas pr&oacute;prias 
	aplica&ccedil;&otilde;es de eCommerce. No esfor&ccedil;o 
	cooperativo e iniciativa de come&ccedil;ar o PHP/FI &agrave; 
	partir da base-usu&aacute;rio existente, Andi, Rasmus e Zeev 
	decidiram cooperar e anunciar o PHP 3.0 como uma vers&atilde;o 
	oficial de seu sucessor o PHP/FI 2.0, e o desenvolvimento 
	do PHP/FI 2.0 foram descontinuados.
   </para>
   <para>
    Uma das maiores caracter&iacute;sticas do PHP 3.0 era sua 
	forte capacidade de extensibilidade. Al&eacute;m de oferecer 
	aos usu&aacute;rios finais uma infraestrutura s&oacute;lida 
	para diversos bancos de dados, protocolos e APIs, o 
	extensibilidade do PHP 3.0 atra&iacute; dezenas de 
	desenvolvedores para se juntar e submeter novos 
	m&oacute;dulos. Esta &eacute; a chave do tremendo sucesso 
	do PHP 3.0. Outras caracter&iacute;sticas chaves introduzidas 
	no PHP 3.0 foram o suporte &agrave; sintaxe para 
	orienta&ccedil;&atilde;o &agrave; objetos e uma sintaxe muito 
	mais poderosa e consistente.
   </para>
   <para>
    A nova vers&atilde;o da linguagem foi realizada sob um 
	novo nome, que removeu a impress&atilde;o do limitado uso 
	pessoal que o PHP/FI 2.0 prendeu. Ela foi nomeada 
	simplesmente 'PHP', com o significado que &eacute; um 
	acr&ocirc;nimo - PHP: Hypertext Preprocessor.
   </para>
   <para>
    No final de 1998, o PHP obteve uma base the dezenas de 
	milhares de usu&aacute;rios (estimativa) e centenas de 
	milhares de Web sites relatando que o tinham instalado. 
	Em seu pico, o PHP 3.0 foi instalado em aproximadamente 
	10% dos servidores Web da Internet.
   </para>
   <para>
    O PHP 3.0 foi oficialmente lan&ccedil;ado em Junho de 
	1998, depois de ter passado aproximadamente 9 meses em 
	testes p&uacute;blicos.
   </para>
  </sect2>

  <sect2 id="history.php4">
   <title>PHP 4</title>
   <para>
    No inverno de 1998, rapidamente ap&oacute;s o PHP 3.0 ser 
	oficialmente lan&ccedil;ado, Andi Gutmans e Zeev Suraski 
	come&ccedil;aram a reescrever o n&uacute;cleo do PHP. Os 
	objetivos do projeto eram melhorar a performance de 
	aplica&ccedil;&otilde;es complexas, e melhorar a 
	modularidade do c&oacute;digo base do PHP. Tais 
	aplica&ccedil;&otilde;es foram poss&iacute;veis por causa 
	das novas caracter&iacute;sticas do PHP 3.0 e o suporte a 
	uma variadade de banco de dados de terceiros e APIs, mas o 
	PHP 3.0 n&atilde;o foi projeto para trabalhar com 
	aplica&ccedil;&otilde;es muito complexas eficientemente.
   </para>
   <para>
    A nova engine, dubbed 'Zend Engine' (conhecidos pelos seus 
	primeiros nomes, Zeev e Andi), fazendo desse objetivo um 
	sucesso, e foi introduzida em meados de 1999. PHP 4.0, 
	baseado nesta engine, e acompanhado com uma s&eacute;rie de 
	novas caracter&iacute;sticas, foi oficialmente 
	lan&ccedil;ada em Maio de 2000, quase dois anos ap&oacute;s 
	o seu predecessor, o PHP 3.0. Al&eacute;m da alt&iacute;ssimo 
	melhoramento da performance desta vers&atilde;o, o PHP 4.0 
	incluiu outras caracter&iacute;sticas chave como o 
	suporte para muitos servidores WEb, sess&otilde;es HTTP, 
	buffer de sa&iacute;da, maneiras mais seguras de manipular 
	input de usu&aacute;rios e muitas constru&ccedil;&otilde;es 
	novas na linguagem.
   </para>
   <para>
    PHP 4 &eacute; a &uacute;ltima vers&atilde;o lana&ccedil;ada 
	do PHP. O trabalho j&aacute; come&ccedil;ou na 
	modifica&ccedil;&atilde;o e melhoramento da Zend Engine 
	para integrar novas caracter&iacute;sticas que foram 
	designadas para o PHP 5.0.
   </para>
   <para>
    Hoje, o PHP est&aacute; come&ccedil;ando a ser usado por 
	centenas de milhares de desenvolvedores (estimativa), e 
	muitos milh&otilde;es de sites reportam que tem o PHP 
	instalado, que explica os 20% de dom&iacute;nios da 
	Internet.
   </para>
   <para>
    O time de desenvolvimento do PHP cont&eacute;m dezenas de 
	desenvolvedores, bem como dezenas de outros que trabalham 
	com projetos relacionados ao PHP como o PEAR e a 
	documenta&ccedil;&atilde;o do projeto.
   </para>
  </sect2>

  <sect2 id="history.php5">
   <title>PHP 5</title>
   <para>
    O futuro do PHP &eacute; dirigido principalmente pelo seu 
	n&uacute;cleo, a Zend Engine. PHP 5 ir&aacute; incluir a 
	nova Zend Engine 2.0. Para obter mais informa&ccedil;&otilde;es 
	sobre esta engine, 
	<ulink url="&url.zend.future;">veja esta p&aacute;gina</ulink>.
   </para>
  </sect2>
 </sect1>
 
 <sect1 id="history.php.related">
  <title>A Hist&oacute;ria dos projetos relacionados ao PHP</title>
  
  <!-- Hope Stig and/or Egon can do this
  
  <sect2 id="history.phpdoc">
   <title>PHP Documentation Project</title>
   <para>
   </para>
  </sect2>
  
  -->

  <sect2 id="history.pear">
   <title>PEAR</title>
   <para>
    PEAR, o reposit&oacute;rio da Extens&atilde;o PHP e da 
	Aplica&ccedil;&atilde;o (originalmente, Extens&atilde;o 
	PHP e Reposit&oacute;rio Add-on) s&atilde;o as 
	vers&otilde;es das classes da funda&ccedil;&atilde;o do 
	PHP, e talvez cres&ccedil;am no futuro para ser um dos 
	caminhos chaves para distribuir o PHP em ambas 
	extens&otilde;es C e PHP entre os colaboradores.
   </para>
   <para>
    O PEAR nasceu em discuss&otilde;es realizadas nas PHP 
	Developers' Meeting-PMD (Reuni&otilde;es dos 
	Desenvolvedores do PHP-RDP) realizada em Janeiro de 
	2000 em Tel Aviv. Foi criada por Sitg S. Bakken, e 
	&eacute; dedicada &agrave; sua primeira 
	filha, Malin Bakken.
   </para>
   <para>
    Desde o come&ccedil;o de 2000, o PEAR cresceu para ser 
	um grande, e significativo projeto com um largo 
	n&uacute;mero de desenvolvedores trabalhando em executar 
	tarefas comuns, funcionalidades reus&aacute;veis 
	para o benef&iacute;cio de toda a comunidade PHP. Hoje 
	em dia o PEAR inclu&iacute; acesso &agrave; base de 
	dados, cache de conte&uacute;do, calcula&ccedil;&otilde;es 
	matem&aacute;ticas, eCommerce e muito mais.
   </para>
  </sect2>

  <sect2 id="history.phpqa">
   <title>A Iniciativa da Garantia de Qualidade do PHP</title>
   <para>
    A Iniciativa da Garantia de Qualidade do PHP foi criada no 
	ver&atilde;o de 2000 em resposta &agrave;s cr&iacute;ticas 
	sobre as vers&otilde;es do PHP n&atilde;o terem sido testadas 
	o bastante para ambientes de produ&ccedil;&atilde;o. O time 
	agora consiste em um grupo de desenvolvedores com um 
	bom entendimento sobre o c&oacute;digo base do PHP. Estes 
	desenvolvedores gastam muito boa parte do tempo deles 
	localizando e consertando bugs dentro do PHP. Al&eacute;m 
	disso h&aacute; muitos outros membros do time que s&atilde;o 
	os que testam e fornecem o feedback destes consertos usando 
	um larga variedade de plataformas.
   </para>
  </sect2>

  <sect2 id="history.phpgtk">
   <title>PHP-GTK</title>
   <para>
    O PHP-GTK &eacute; a solu&ccedil;&atilde;o PHP para 
	aplica&ccedil;&otilde;es GUI client side (lado-cliente). 
	Andrei Zmievski recorda o processo de planejamento e 
	cria&ccedil;&atilde;o do PHP-GTK:
   </para>
   <blockquote>
    <para>
	 A programa&ccedil;&atilde;o GUI sempre foi de meu interesse, e eu 
	 achei que o Gtk+ &eacute; uma ferramenta muito boa, exceto que a 
	 programa&ccedil;&atilde;o dela usa o C que algumas vezes &eacute; 
	 um t&eacute;dio. Ap&oacute;s testemunhar as 
	 implementa&ccedil;&otilde;es do PyGtk e GTK-Perl, eu decidi ver se 
	 o PHP poderia ter uma interface Gtk+. Come&ccedil;ando em Agosto de 
	 2000, eu comecei a ter um pouco mais de tempo livre que foi quando 
	 eu comecei a experimentar. Minha linha guia principal foi a 
	 implementa&ccedil;&atilde;o da interface PyGtk. James Henstridge, 
	 o autor do PyGtk, me ajudou muito durante os est&aacute;gios 
	 iniciais.
    </para>
    <para>
	 Escrever as interfaces na m&atilde;o para todas as 
	 fun&ccedil;&otilde;es do Gtk+ estava fora de quest&atilde;o, 
	 ent&atilde;o eu tive uma id&eacute;ia de criar um gerador de 
	 c&oacute;digo, similar &agrave; como o PyGtk foi feito. O gerador 
	 de c&oacute;digo &eacute; um programa PHP que l&ecirc; uma 
	 s&eacute;rie de arquivos .def contendo as classes Gtk+, constantes, 
	 e as informa&ccedil;&otilde;es dos m&eacute;todos e geradores de 
	 c&oacute;digo C que ir&atilde;o trabalhar com o PHP.O que 
	 n&atilde;o pode ser gerado automaticamente pode ser escrito em 
	 arquivos .overrides.
    </para>
    <para>
	 Trabalhando no gerador de c&oacute;digo e na infraestrutura 
	 levou algum tempo, porque eu tinha pouco tempo para trabalhar 
	 no PHP-GTK durante o fim de 2000. Depois de eu mostrar o 
	 PHP-GTK ao Frank Kromann, ele se interessou e come&ccedil;ou 
	 a me ajudar com o gerador de c&oacute;digo e a 
	 implementa&ccedil;&atilde;o para Win32. Quando n&oacute;s 
	 escrevemos o primeiro programa 'Hello World' e o rodamos, foi 
	 extremamente exitante. Levou mais alguns meses para deixar o 
	 projeto em uma condi&ccedil;&atilde;o apresent&aacute;vel e 
	 lan&ccedil;ar a vers&atilde;o inicial realizada em 1 de 
	 Mar&ccedil;o de 2001. que logo foi apresentada no SlashDot.
    </para>
    <para>
	 Detetando que o PHP-GTK pode ser extensivo, eu decidi 
	 separar as listas de discuss&atilde;o e os 
	 reposit&oacute;rios CVS para isto, bem como o website 
	 gtk.php.net com ajuda de Colin Viebrock. A 
	 documenta&ccedil;&atilde;o tamb&eacute;m era 
	 necess&aacute;ria ser feita e James Moore veio me ajudar 
	 com isto.
    </para>
    <para>
	 Desde sua realização o PHP-GTK vem ganhando popularidade. 
	 Agora, n&oacute;s temos nosso pr&oacute;prio time de 
	 documenta&ccedil;&atilde;o, o manual continua melhorando, 
	 as pessoas come&ccedil;am a escrever extens&otilde;es para 
	 o PHP-GTK, e mais e mais aplicativos excitantes com ele.
    </para>
   </blockquote>
  </sect2>
 </sect1>

 <sect1 id="history.php.books">
  <title>Livros sobre PHP</title>
  <para>
   O PHP cresceu, ele come&ccedil;ou a ser reconhecido 
   mundialmente como a plataforma mais popular. Uma das 
   maneiras mais interessantes de ver esta tend&ecirc;ncia 
   &eacute; observar os livros sobre PHP que surgir&atilde;o 
   ao longo dos anos.
  </para>
  <para>
   Até onde nós sabemos, o primeiro livro dedicado ao PHP 
   foi 'PHP- tvorba interaktivn&iacute;ch internetov&yacute;ch 
   aplikac&iacute;' - um livro Czech publicado em Abril de 1999, 
   pela autora Jirka Kosek. No m&ecirc;s seguinte veio o livro 
   Alem&atilde;o escrito por Egon Schmid, Christian Cartus e Richard 
   Blume. O primeiro livro em Ingl&ecirc;s sobre PHP foi publicado 
   logo depois, e foi chamado 'Core PHP Programming' por Leon Atkinson. 
   Todos estes livros falavam sobre o PHP 3.0.
  </para>
  <para>
   Quando estes livros eram os primeiros deste tipo - eles inspiraram 
   um grande n&uacute;mero de livros de outros autores e editoras. 
   H&aacute; aproximadamente 40 livros em Ingl&ecirc;s, 50 livros em 
   Alem&atilde;o, e uns 20 livros em Franc&ecirc;s! Al&eacute;m disso, 
   voc&ecirc; pdoe encontrar livros sobre PHP em muitas outras 
   l&iacute;nguas, incluindo Espanhol, Kore&acirc;no, Japon&ecirc;s 
   e Hebrew.
  </para>
  <para>
   Obviamente, este grande n&uacute;mero de livros, escritos por 
   diferentes autores, publicados por muitas editoras, e 
   dispon&iacute;veis em muitas l&iacute;nguas - &eacute; uma 
   prova do sucesso mundial do PHP.
  </para>
 </sect1>
 
 <sect1 id="history.php.publications">
  <title>Publica&ccedil;&otilde;es sobre PHP</title>
  <para>
   At&eacute; onde n&oacute;s sabemos, o primeiro artigo sobre PHP foi 
   publicado em uma revista parecida com a Computerworld na Czech em 
   meados de 1998, e cobria o PHP 3.0. Como os livros, este foi um de 
   uma s&eacute;rio de muitos artigos publicados sobre PHP em 
   v&aacute;rias revistas proeminentes.
  </para>
  <para>
   Artigos sobre PHP apareceram no Dr. Dobbs, Empresas de Linux, 
   Revistas de Linux e em muitos outros lugares. Artigos sobre 
   migra&ccedil;&atilde;o de aplica&ccedil;&otilde;es baseadas em 
   ASP para PHP rodando Windows foram publicadas mesmo na Microsoft 
   e at&eacute; mesmo na MSDN!
  </para>
 </sect1>

</appendix>

<!-- Keep this comment at the end of the file
Local variables:
mode: sgml
sgml-omittag:t
sgml-shorttag:t
sgml-minimize-attributes:nil
sgml-always-quote-attributes:t
sgml-indent-step:1
sgml-indent-data:t
indent-tabs-mode:nil
sgml-parent-document:nil
sgml-default-dtd-file:"../../manual.ced"
sgml-exposed-tags:nil
sgml-local-catalogs:nil
sgml-local-ecat-files:nil
End:
vim600: syn=xml fen fdm=syntax fdl=2 si
vim: et tw=78 syn=sgml
vi: ts=1 sw=1
-->
